Autodesk.Revit.DB.Plane.Normal
Get the Normal of the plane.
Remarks: This property is used to get the Normal of the plane.

Autodesk.Revit.DB.Plane.YVec
Get the YVec of the plane.
Remarks: This property is used to get the YVec of the plane.

Autodesk.Revit.DB.Plane.XVec
Get the XVec of the plane.
Remarks: This property is used to get the XVec of the plane.

Autodesk.Revit.DB.Plane.Origin
Get the Origin of the plane.
Remarks: This property is used to get the Origin of the plane.

Autodesk.Revit.DB.Plane.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructor for geometry plane.
norm: The normal vector of the plane.
origin: The coordinates for the origin.
Remarks: Used to construct a new Plane object.

Autodesk.Revit.DB.Plane.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Constructor for geometry plane.
xVec: The vector for x-axis.
yVec: The vector for y-axis.
origin: The coordinates for the origin.
Remarks: Used to construct a new Plane object.

Autodesk.Revit.DB.Plane
Provides access to the geometry plane object.
Remarks: The user can construct a plane object, get or set the vectors and origin through
this class.